In [1]:
import pandas as pd
import numpy as np

In [2]:
veriler={
    "İstanbul":[29,30,np.nan],
    "Ankara":[15,np.nan,20],
    "Malatya":[30,25,30]
}

In [3]:
hava_durumu=pd.DataFrame(veriler)

In [4]:
index_listesi=["Pazartesi","Salı","Çarşamba"]

In [5]:
hava_durumu["Günler"]=index_listesi

In [6]:
hava_durumu.set_index("Günler",inplace=True)

In [7]:
hava_durumu

           İstanbul  Ankara  Malatya
Günler
Pazartesi      29.0    15.0       30
Salı           30.0     NaN       25
Çarşamba        NaN    20.0       30

In [8]:
hava_durumu.dropna() # nan olan değerleri atıp yeni tablo oluşturur.(Satır)

           İstanbul  Ankara  Malatya
Günler
Pazartesi      29.0    15.0       30

In [9]:
hava_durumu.dropna(axis=1) #nan olan değerleri kolondan atar.

           Malatya
Günler
Pazartesi       30
Salı            25
Çarşamba        30

In [10]:
#hava_durumu.dropna(axis=1,thresh=2) nan olan 2 den fazla olanları kolondan atar .

In [11]:
hava_durumu.fillna(20) #nan olan değerlerin yerine 20 yazar.

           İstanbul  Ankara  Malatya
Günler
Pazartesi      29.0    15.0       30
Salı           30.0    20.0       25
Çarşamba       20.0    20.0       30

## groupBy

In [15]:
sirketData={
    "Departman":["Yazılım","Yazılım","Satış","Satış","Hukuk","Hukuk"],
    "Calisan":["Ahmet","Ömer","Kerem","Sayit","Ayşe","Fatma"],
    "Maas":[2000,3000,4000,5000,6000,7000]
}

In [16]:
sirketVeri=pd.DataFrame(sirketData)

In [17]:
sirketVeri

  Departman Calisan  Maas
0   Yazılım   Ahmet  2000
1   Yazılım    Ömer  3000
2     Satış   Kerem  4000
3     Satış   Sayit  5000
4     Hukuk    Ayşe  6000
5     Hukuk   Fatma  7000

In [20]:
groupObject=sirketVeri.groupby("Departman")

In [22]:
groupObject.count()

           Calisan  Maas
Departman
Hukuk            2     2
Satış            2     2
Yazılım          2     2

In [23]:
groupObject.mean()

           Maas
Departman
Hukuk      6500
Satış      4500
Yazılım    2500

In [24]:
groupObject.min()

          Calisan  Maas
Departman
Hukuk        Ayşe  6000
Satış       Kerem  4000
Yazılım     Ahmet  2000

In [25]:
groupObject.max()

          Calisan  Maas
Departman
Hukuk       Fatma  7000
Satış       Sayit  5000
Yazılım      Ömer  3000

In [26]:
groupObject.describe()

           Maas
          count    mean         std     min     25%     50%     75%     max
Departman
Hukuk       2.0  6500.0  707.106781  6000.0  6250.0  6500.0  6750.0  7000.0
Satış       2.0  4500.0  707.106781  4000.0  4250.0  4500.0  4750.0  5000.0
Yazılım     2.0  2500.0  707.106781  2000.0  2250.0  2500.0  2750.0  3000.0